{
"slap" : {
 "1" : "https://33.media.tumblr.com/4a58a89eaaea25571fcc03d3788b1e55/tumblr_nel3qwSzqw1tblzm8o1_500.gif",
 "2" : "https://i.imgur.com/X1jTejT.gif",
 "3" : "https://gifdb.com/images/high/jujutsu-kaisen-yuji-anime-slap-e1qskbqw3i8659c2.gif",
 "4" : "https://media.tenor.com/Sv8LQZAoQmgAAAAM/chainsaw-man-csm.gif",
 "5" : "https://media1.tenor.com/m/9q1P4rMWdnAAAAAC/cautious.gif",
 "6" : "https://tenor.com/fr/view/anime-slap-slap-anime-gif-23297969",
 "7" : "https://media.tenor.com/PhXFEGKoiBYAAAAM/the-god-of-high-school-anime.gif",
 "8" : "https://media.tenor.com/5jBuDXkDsjYAAAAM/slap.gif"
},
"stare" : {
 "1" : "https://media.tenor.com/IdLz4mC7regAAAAM/anya-forger-anime.gif",
 "2" : "https://media.tenor.com/EYoyySlqhxwAAAAM/naruto-obito.gif",
 "3" : "https://media.tenor.com/bz7NmlOasDEAAAAM/kite-hxh-hunter-x-hunter.gif",
 "4" : "https://media.tenor.com/PgU5Le17cEAAAAAM/demon-slayer-demon-slayer-characters.gif",
 "5" : "https://tenor.com/fr/view/rin-okumura-ao-no-exorcist-glare-annoyed-anime-gif-13575976",
 "6" : "https://media.tenor.com/eCA6IWEM7ywAAAAM/technoblade-glare.gif",
 "7" : "https://media.tenor.com/3Qlb7WrciwQAAAAM/chainsaw-man-csm.gif",
 "8" : "https://media.tenor.com/B1FfwbMcw-YAAAAM/anime-anime-boy.gif"
},
"pout" :{
 "1" : "https://media.tenor.com/1MJWE_7lGKEAAAAM/anime-pout.gif",
 "2" : "https://media.tenor.com/4tXvn7g292oAAAAM/shikimoris-not-just-cute-shikimori.gif",
 "3" : "https://64.media.tumblr.com/90a94679f5c8e0753f8583d57f6cad86/tumblr_osrntgZ6hZ1wn2b96o1_400.gif",
 "4" : "https://media.tenor.com/vk8v8SVUG-MAAAAM/frieren-frieren-beyond-journey%27s-end.gif",
 "5" : "https://media.tenor.com/bqdATAYxLd4AAAAM/senpai-hachioji-naoto.gif",
 "6" : "https://media.tenor.com/hi75ih133DYAAAAM/fushi-pout-fushi.gif",
 "7" : "https://media.tenor.com/UaKmfHiCwAcAAAAM/anime-sad.gif",
 "8" : "https://media.tenor.com/GOVhoLpVCosAAAAM/dontmesswithme-pout.gif"

},
"pat" :{
 "1" : "https://media.tenor.com/kIh2QZ7MhBMAAAAM/tsumiki-anime.gif",
 "2" : "https://media.tenor.com/Zm71HaIh7wwAAAAM/pat-pat.gif",
 "3" : "https://media.tenor.com/a6Qk3VON9aYAAAAM/re-zero-typhon.gif",
 "4" : "https://media.tenor.com/oGbO8vW_eqgAAAAM/spy-x-family-anya.gif",
 "5" : "https://media.tenor.com/Nc6VJPpj_NsAAAAM/anime-pat.gif",
 "6" : "https://media.tenor.com/wLqFGYigJuIAAAAM/mai-sakurajima.gif",
 "7" : "https://media.tenor.com/Dbg-7wAaiJwAAAAM/aharen-aharen-san.gif",
 "8" : "https://media.tenor.com/8DaE6qzF0DwAAAAM/neet-anime.gif"

},
"kiss" :{
 "1" : "https://media.tenor.com/9u2vmryDP-cAAAAM/horimiya-animes.gif",
 "2" : "https://media.tenor.com/IAP6odUutZMAAAAM/kiss.gif",
 "3" : "https://media.tenor.com/F02Ep3b2jJgAAAAM/cute-kawai.gif",
 "4" : "https://media.tenor.com/Gv38EiXASmoAAAAM/frieren-sousou-no-frieren.gif",
 "5" : "https://media.tenor.com/Fyq9izHlreQAAAAM/my-little-monster-haru-yoshida.gif",
 "6" : "https://media.tenor.com/3xrkm45MqkIAAAAM/anime-kiss.gif",
 "7" : "https://media.tenor.com/sfVu2iyyVR4AAAAM/kaito-kuroba-kaito-kid.gif",
 "8" : "https://media.tenor.com/jNLEPcLWvO8AAAAM/anime-nose.gif"

},

"hug" :{
 "1" : "https://i.pinimg.com/originals/68/d2/ea/68d2ea7681798c4d6cf53c22e959bd81.gif",
 "2" : "https://media.tenor.com/MApGHq5Kvj0AAAAM/anime-hug.gif",
 "3" : "https://gifdb.com/images/high/emotional-anime-cuddle-ax676lcjjauryb1q.gif",
 "4" : "https://d31xsmoz1lk3y3.cloudfront.net/games/imgur/41YhQor.gif",
 "5" : "https://64.media.tumblr.com/bcfe86698a7fff08dd9eda13eea89b5c/d209a47569965386-bc/s540x810/eb1b00da3c245f8dd6666457a59d5e80725c392b.gif",
 "6" : "https://media.tenor.com/cmAf-WYo-RkAAAAM/hug-friends.gif",
 "7" : "https://media.tenor.com/EO1YbHaFDXcAAAAM/nezuko-demon-slayer.gif",
 "8" : "https://media.tenor.com/8o4fWGwBY1EAAAAM/aharensan-aharen.gif"

},
"smile" :{
 "1" : "https://media.tenor.com/KHZEaH1uFHQAAAAM/frieren-frieren-beyond-journey%27s-end.gif",
 "2" : "https://media.tenor.com/xfFGs2vvOioAAAAM/vanitas-no.gif",
 "3" : "https://media.tenor.com/B5mG_MXzno0AAAAM/anime-taiga-aisaka.gif",
 "4" : "https://media.tenor.com/P80RbbzxQU0AAAAM/izuku-midoriya-smile.gif",
 "5" : "https://media.tenor.com/Uay-zK3mItcAAAAM/happy-rezero.gif",
 "6" : "https://gifdb.com/images/high/soul-eater-evans-smiling-79g2q5wosbhtccpv.gif",
 "7" : "https://66.media.tumblr.com/tumblr_lya2iiSY9v1rn95k2o1_500.gif",
 "8" : "https://gifdb.com/images/high/tokyo-ghoul-kaneki-smiling-reaction-hptth9gbu0e3163r.gif"
},
"confession" : {
    "1" : "Tel un murmure dans le vent, une vérité cherche à se dévoiler.",
    "2" : "Les mots se bousculent, les émotions s'entremêlent, mais une seule vérité demeure.",
    "3" : "Dans le silence de la nuit, un cœur cherche à s'ouvrir.",
    "4" : "Comme une étoile filante, un secret s'apprête à briller dans l'obscurité.",
    "5" : "Les pensées flottent, portées par le souffle léger d'une confession.",
    "6" : "Un cœur chargé de mots non dits cherche à s'alléger.",
    "7" : "Les émotions, telles des vagues, se précipitent vers la rive de la vérité.",
    "8" : "Dans le doux murmure de l'âme, une confession se prépare à éclore.",
    "9" : "Comme une brise légère, une confidence cherche à se faire entendre.",
    "10" : "Sous le voile de la discrétion, un secret se dévoile doucement.",
    "11" : "Dans le jardin des secrets, une fleur de vérité est sur le point d'éclore.",
    "12" : "Les murmures du cœur s'élèvent, porteurs d'une confession intime.",
    "13" : "À l'aube de la révélation, une âme cherche à se libérer de son fardeau.",
    "14" : "Comme une plume légère, une confidence se pose délicatement dans l'air.",
    "15" : "Dans les ombres de la nuit, les secrets dansent avec les étoiles, attendant leur moment pour briller.",
    "16" : "Les mots se tissent, formant un fil d'or qui relie les cœurs dans une douce mélodie.",
    "17" : "Comme les pétales d'une rose s'ouvrent au lever du soleil, une confession se dévoile à la lumière de la vérité.",
    "18" : "Tel un voyageur solitaire sous un ciel étoilé, un secret traverse les vastes étendues de l'âme, cherchant refuge dans la lumière.",
    "19" : "Les mots, tels des papillons, prennent leur envol, emportant avec eux les souvenirs et les vérités cachées.",
    "20" : "Dans le calme de la nuit, les murmures de l'âme résonnent comme une douce mélodie, prête à être entendue par ceux qui écoutent attentivement.",
    "21" : "Comme une pluie d'étoiles filantes, les confessions tombent du ciel de l'âme, illuminant la nuit de leur éclat fugace."
},
"duelMessages" : {
    "start" :[ 
        "En garde ! Prépare-toi à être étonné par mes incroyables compétences... ou à rire de ma maladresse !",
        "C'est comme dans les vieux films de chevalerie, sauf que personne ne tombe amoureux à la fin. Enfin, pas encore !",
        "Les règles sont simples : pas de coups bas, pas de magie noire, juste deux personnes se battant pour leur honneur... et peut-être une petite gloriole !",
        "Que le meilleur... ou le plus chanceux gagne !",
        "Les dés sont jetés ! Prêt à te montrer de quoi je suis capable ?",
        "La tension est à son comble ! Qui sortira vainqueur de ce duel épique ?",
        "Je suis prêt à en découdre, mais je ne promets rien sur la grâce de mes mouvements !",
        "Que les étoiles soient avec nous dans ce duel digne des plus grandes légendes !",
        "Les paris sont ouverts ! Qui de nous deux sortira vainqueur de ce combat épique ?",
        "Prépare-toi à affronter mon arme secrète : l'imprévisibilité totale !",
        "Je vais te montrer ce que signifie vraiment se battre pour son honneur... ou peut-être que je vais juste trébucher !",
        "Je suis peut-être un guerrier, mais je suis aussi un romantique dans l'âme. Prêt à te battre pour mon cœur ?",
        "Je ne sais pas pourquoi nous nous battons, mais je sais que je ne peux pas résister à tes yeux envoûtants !",
        "Je ne sais pas si je vais gagner ce duel, mais je sais que je suis déjà tombé sous ton charme !"

    ],
    "combat" : [
        "La tension est palpable, mais mes chaussettes le sont encore plus !",
        "Attention, je vais te montrer ma technique secrète : l'art du désespoir total !",
        "Prends ça ! Et ça ! Et... oh mince, je crois que j'ai trébuché sur mon propre pied.",
        "J'ai appris cette technique dans un vieux manuel de combat... ou peut-être que c'était dans un livre de cuisine. Dans tous les cas, ça va faire mal !",
        "Je suis comme une ombre, rapide, furtif... oh non, attends, c'était juste un nuage qui passait devant le soleil !",
        "Chaud devant ! Tu ferais mieux de te protéger, car je ne vais pas retenir mes coups !",
        "Je suis comme un chat, rapide et agile... sauf que je n'ai pas de griffes rétractables !",
        "Prends garde à ma technique ultime : l'attaque de la feuille morte !",
        "Je vais te montrer ce que c'est que de se battre avec le cœur... et peut-être aussi avec les pieds !",
        "Je suis tel un rocher, solide et immobile... ou du moins, j'essaie de l'être !",
        "Je vais frapper fort, frapper vite, et peut-être même frapper dans le vide !",
        "Je suis peut-être en train de me battre, mais je ne peux m'empêcher de penser à la façon dont tes cheveux brillent sous le soleil !",
        "Je suis peut-être en train de perdre, mais je suis sûr de gagner ton cœur avec mon charme légendaire !"
        
    ],
        
    "progression" : [ 
        "Les choses se corsent ! Mais ne t'inquiète pas, je suis comme un fromage : je deviens meilleur avec l'âge !",
        "Tu te débrouilles plutôt bien ! Mais n'oublie pas que je suis plein de surprises... surtout les mauvaises !",
        "Je ne sais pas pour toi, mais je commence à transpirer autant qu'un glaçon en plein désert !",
        "Tu crois que tu m'as coincé ? Ha ! J'ai juste besoin d'un peu plus d'espace pour... euh... réfléchir à ma prochaine attaque !",
        "On dirait bien que ça devient sérieux ! Prépare-toi à goûter à la puissance de ma lame !",
        "Chaque coup compte ! Je suis prêt à donner le meilleur de moi-même pour sortir victorieux de ce duel !",
        "Le combat s'intensifie, mais je suis comme un vieux vin : je me bonifie avec le temps !",
        "Tu es un adversaire redoutable, mais je ne suis pas en reste ! La victoire est encore incertaine !",
        "Je commence à suer comme un homme-grenouille sous le soleil, mais je ne lâcherai rien !",
        "Tu penses avoir le dessus ? Ha ! Je ne fais que commencer à dévoiler mes véritables capacités !",
        "Nous approchons de la fin du combat, et je suis prêt à donner tout ce que j'ai pour l'emporter !",
        "Le combat s'intensifie, mais je suis comme un feu de joie : je brûle de plus en plus fort pour toi !",
        "Tu es un adversaire redoutable, mais je suis sûr que nous pourrions faire une équipe encore plus redoutable... dans la vie comme dans le combat !",
        "Je suis peut-être en sueur, mais je suis aussi en train de tomber amoureux de toi !",
        "Tu penses avoir le dessus ? Ha ! Je ne fais que commencer à dévoiler mes véritables sentiments pour toi !",
        "Nous approchons de la fin du combat, et je suis prêt à tout donner pour toi... et pour la victoire, bien sûr !"
                
    ],

    "finV" :[
        "Et voilà ! Le combat est terminé et la victoire est mienne ! Je savais que mes talents étaient irrésistibles !",
        "Bravo à moi ! J'ai gagné ! J'espère que tu as apprécié ton voyage au pays de la défaite !",
        "Ah, la victoire ! Ça a un goût sucré, comme une barre de chocolat après une longue marche... sauf que c'était un duel et non une randonnée !",
        "Victoire ! Je savais que mon entraînement intensif de trois minutes par jour porterait ses fruits !",
        "Je suis victorieux ! La défaite n'était pas une option, sauf peut-être dans mon esprit pendant un court instant !",
        "La victoire est mienne ! Je vais savourer ce moment, mais je ne sous-estimerai plus jamais mes adversaires !",
         "Victoire ! Je savais que mon charme légendaire finirait par porter ses fruits !",
        "Je suis victorieux, mais je sais que la vraie victoire, c'est d'avoir gagné ton cœur !",
        "Je suis peut-être le vainqueur de ce combat, mais je sais que je suis aussi le plus chanceux de t'avoir à mes côtés !"
    ],

    "finL" :[
        "Eh bien, ce n'était pas mon jour ! Félicitations à toi pour cette victoire bien méritée. Mais je reviendrai, plus fort que jamais !",
        "Défaite... un mot difficile à avaler. Mais bon, au moins j'ai appris une leçon : ne jamais sous-estimer mon adversaire... surtout quand il a une épée !",
        "Ah, la défaite. C'est comme une douche froide pour mon ego. Mais ne t'en fais pas, je suis déjà en train de planifier ma revanche !",
         "Cette défaite ne me dérange pas. Je considère cela comme un entraînement pour devenir encore plus fort !",
         "Défaite... Je vais devoir ajouter quelques minutes supplémentaires à mon entraînement quotidien !",
        "Je m'incline devant toi, tu as été le meilleur dans ce combat. Mais je reviendrai, plus fort et plus déterminé !",
        "La défaite est amère, mais elle est aussi une excellente leçon. Je vais apprendre de mes erreurs et revenir plus fort !",
        "Je m'incline devant toi, tu as été le meilleur dans ce combat. Mais je sais que je suis le meilleur pour toi dans la vie !",
        "La défaite est amère, mais elle est aussi une excellente leçon. Je vais apprendre de mes erreurs et revenir plus fort... et plus séduisant que jamais !",
        "Cette défaite ne me dérange pas. Je considère cela comme un entraînement pour devenir encore plus fort... et pour gagner ton cœur !"
    ],
   

    "finDJ1" :[
        "Egalité ! Qui aurait cru ? Ni gagnant ni perdant, juste deux combattants épuisés et probablement un peu confus !",
        "Une égalité, hein ? Je suppose que cela signifie que nous sommes parfaitement assortis en matière de compétences... ou de maladresse !",
        "Le duel se termine sur une note d'égalité. Peut-être que nous devrions régler ça avec une partie de pierre-papier-ciseaux la prochaine fois !",
        "Une égalité, vraiment ? Je pensais que l'un de nous finirait par l'emporter, mais je suppose que c'est le destin qui décide !",
        "Égalité ? Je suppose que cela signifie que nous sommes tout aussi maladroits l'un que l'autre !",
        "Nous avons tous les deux montré nos forces et nos faiblesses, et cela a abouti à une égalité. Peut-être que nous devrions simplement nous serrer la main et partir en bons termes !",
        "Égalité ? Je suppose que cela signifie que nous sommes tout aussi séduisants l'un que l'autre !",
        "Nous avons tous les deux montré nos forces et nos faiblesses, et cela a abouti à une égalité. Peut-être que nous devrions simplement nous embrasser et partir en bons termes !"
    ],
    "finDJ2": [
        "Egalité ! C'est incroyable, n'est-ce pas ? Nous sommes vraiment très proches en termes de compétences. Bon, cela signifie que nous devons juste recommencer à nous battre jusqu'à ce qu'il y ait un vainqueur indéniable !",
        "Egalité ? Nous sommes vraiment dans une impasse. Peut-être que nous devrions envisager une trêve et devenir amis à la place !",
        "Faison l'amour pas la guerre, n'est-ce pas ? Une égalité, c'est comme un signe que nous sommes destinés à être des alliés plutôt que des ennemis !",
        "Un match nul, c'est presque comme une victoire, non ? Nous avons tous les deux montré de quoi nous étions capables, et c'était une bataille bien disputée !",
        "Je ne sais pas pour toi, mais je me suis bien amusé dans ce combat. Une égalité, c'est une bonne raison de se réjouir et de célébrer notre esprit combatif !",
        "Égalité ! C'est incroyable, n'est-ce pas ? Nous sommes vraiment très proches en termes de compétences... et de sentiments !",
        "Egalité ? Nous sommes vraiment dans une impasse. Peut-être que nous devrions envisager une trêve... et un rendez-vous galant à la place !",
        "Faison l'amour pas la guerre, n'est-ce pas ? Une égalité, c'est comme un signe que nous sommes destinés à être des amants plutôt que des ennemis !",
        "Un match nul, c'est presque comme une victoire, non ? Nous avons tous les deux montré de quoi nous étions capables, et c'était une bataille bien disputée... pour ton cœur !",
        "Je ne sais pas pour toi, mais je me suis bien amusé dans ce combat. Une égalité, c'est une bonne raison de se réjouir, de célébrer notre esprit combatif !"
]
}

}